[
    {
        "review": "Highly Recommended !! Experiences & Perspectives brings in quality content & unique views on Personal Journals. Great to Listen. What I really enjoy is that it makes me aware about different perspectives on various topics in a pleasant way.",
        "by": "Prachi Pant"
    },
    {
        "review":"I started listening to the podcast because I like discussing the philosophy of a good life. But I was surprised at how much it's been enriching my worldview. Every episode, the host brings up a new and sometimes unexpected topic that either adds to my current perspective or challenges my thoughts in interesting ways. If you are into self-improvement and intellectual exploration, this is the podcast.",
        "by": "Isaura Viggiano Souza"
    },
    {
        "review":"It's truly is what it's named! Experience of different people on a vast scope of topics! It gives you a feel of meeting & getting to know people even if you are not practically with them. The topics are dynamic & don't bore you out! All in all after a hectic day, one needs to listen to it for a calm feel.",
        "by": "Disha Lohani"
    },
    {
        "review":"With his deep knowledge & skill in facilitating conversations, Siddharth brings forth fresh perspectives on a variety of subjects. The carefully selected guests contribute their expertise in a relatable manner, providing listeners with valuable insights. The thoughtfully crafted discussions & genuine atmosphere make it a captivating experience akin to having an intimate conversation with friends.",
        "by": "Abhinav Anand"
    },
    {
        "review":"It's quite captivating Podcast that offers a very good place for individuals seeking intellectual companionship and throught-provoking conversations. With expert guests, this Podcast takes one on an enlightening journey through personal experiences and deep discussions of various relatable and interesting topics. This is a must listen for anyone craving intellectual camaraderie and profound conversations in their life.",
        "by": "Qamar Shahba"
    }
]